app/controllers/subreddits_controller.rb

INSERT INTO `subreddits` (`name`, `created_at`, `updated_at`) VALUES ('pics', '2015-12-04 02:00:53', '2015-12-04 02:00:53')
---
  def create
    @user = current_user
    @subreddit = Subreddit.new(subreddit_params)
    if @subreddit.save