app/controllers/users_controller.rb

	def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `username`, `password_digest`, `created_at`, `updated_at`) VALUES ('nigga', 'nigga', 'nigga@gmail.com', 'nigga', '$2a$10$V.MHTd5JSNFjajXuAsv0weyURSt3RAdQz4bJ3D12gkfOaDzd497kS', '2015-12-02 07:04:06', '2015-12-02 07:04:06')